export default {
  projections: {
    СведенияE: {
      код: {
        __caption__: 'Код'
      },
      кличка: {
        __caption__: 'Кличка'
      },
      корма: {
        __caption__: 'Корма',
        типКорма: {
          __caption__: 'Тип корма'
        }
      },
      вид: {
        __caption__: 'Вид',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      клетки: {
        __caption__: 'Клетки',
        номерКлетки: {
          __caption__: 'Номер клетки'
        },
        типКлетки: {
          __caption__: 'Тип клетки'
        }
      }
    }
  },
  validations: {
    кличка: {
      __caption__: 'Кличка'
    },
    код: {
      __caption__: 'Код'
    },
    вид: {
      __caption__: 'Вид'
    },
    клетки: {
      __caption__: 'Клетки'
    },
    корма: {
      __caption__: 'Корма'
    },
    животные: {
      __caption__: 'животные'
    }
  }
};
