export default {
  projections: {
    СотрудникиE: {
      табличНомер: {
        __caption__: 'Таблич номер'
      },
      кодДолжности: {
        __caption__: 'Код должности'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      должность: {
        __caption__: 'Должность',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    },
    СотрудникиL: {
      табличНомер: {
        __caption__: 'Таблич номер'
      },
      кодДолжности: {
        __caption__: 'Код должности'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      должность: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    кодДолжности: {
      __caption__: 'Код должности'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    табличНомер: {
      __caption__: 'Таблич номер'
    },
    фамилия: {
      __caption__: 'Фамилия'
    },
    должность: {
      __caption__: 'Должность'
    }
  }
};
